gdgly/NUC97X_JS/STM32F4xx/Terminal/Terminal_ReadMeter_Fn_Project2xx_USER6xx.c

#include "Project.h"
#include "Terminal_ReadMeter_Fn.h"
#include "../Calculate/Calculate.h"
#include "Terminal_AFN0C_RealTimeData_Fn.h"
#include "Terminal_AFN0D_CongealData_Fn.h"
#include "Terminal_AFN0D_SourceData_Fn.h"
#include "../STM32F4xx/STM32F4xx_UART.h"
#include "../Device/MEMRW.h"
#include "KeyUser.h"
#include "../Terminal/Terminal_AFN04_Paramter_Check.h"
#include "Terminal_AFN0E_Event.h"
#include "Terminal_ReadMeter_Event.h"


#if Project==200//集中器
#if (USER/100)==6//湖南系



#define RMM_TimerTask     0//0=不抄,1=自动抄读定时任务配置的相关数据
#define RMM_Event     0//0=不抄,1=自动抄读事件记录配置的相关数据


#if RMM_TimerTask==1//0=不抄,1=自动抄读定时任务配置的相关数据
u32 CompFnPn(u32 DI,u32 Fn,u32 Pn)//分解DI为Fn,Pn且比较;返回0=不同,1=有相同;使用ADDR_DATABUFF
{
	u32 FnPn;
	u8 *p8;
	u32 *p32;
	p8=(u8*)(ADDR_DATABUFF);
	p32=(u32*)(ADDR_DATABUFF);
	
	p32[0]=DI;
	//Pn
	DI&=0xffff;
	if(DI!=0x00ff)
	{//不是全部有效测量点
		if(p8[1]==0x0)
		{
			return 0;//Pn=0;
		}
		else
		{
			if(p8[0]==0x0)
			{
				return 0;//Pn=0;
			}
			else
			{
				while(1)
				{
					FnPn=BitLoca(p8[0]);//计算第1个置位为1的位置(0-32)
					DI=p8[0];
					DI<<=1;
					DI&=(~(1<<FnPn));
					DI>>=1;
					p8[0]=DI;
					FnPn+=((p8[1]-1)*8);
					if(FnPn==Pn)
					{
						break;
					}
					if(DI==0)
					{//分解完
						return 0;
					}
				}
			}
		}
	}
	//Fn
	if(p8[2]==0x0)
	{
		return 0;//Fn=0;
	}
	else
	{
		while(1)
		{
			FnPn=BitLoca(p8[2]);//计算第1个置位为1的位置(0-32)
			DI=p8[2];
			DI<<=1;
			DI&=(~(1<<FnPn));
			DI>>=1;
			p8[2]=DI;
			FnPn+=(p8[3]*8);
			if(FnPn==Fn)
			{
				return 1;
			}
			if(DI==0)
			{//分解完
				return 0;
			}
		}
	}
}
u32 ReadMeter_Fn_Class1TimerTask(u32 Fn,u32 Pn)//FnPn在1类数据定时任务,返回:0=没,1=有;使用 ADDR_DATABUFF
{
	u32 i;
	u32 Task;
	u32 MaxDINum;
	u32 DI;
	
	for(Task=0;Task<AFN04F65MaxPn;Task++)
	{
		i=MRR(ADDR_AFN04F67+Task,1);//定时发送1类数据任务启动／停止设置(任务号)
		if(i!=0x55)
		{//置"55H"：启动；置"AAH"停止；其它数值无效
			continue;
		}
		MaxDINum=MRR(ADDR_AFN04F65+((9+(4*MaxTimerTaskDI))*Task)+8,1);
		if(MaxDINum>MaxTimerTaskDI)
		{
			MaxDINum=MaxTimerTaskDI;
		}
		for(i=0;i<MaxDINum;i++)
		{
			DI=MRR(ADDR_AFN04F65+((9+(4*MaxTimerTaskDI))*Task)+9+(4*i),4);//取DI
			DI=CompFnPn(DI,Fn,Pn);//分解DI为Fn,Pn且比较;返回0=不同,1=有相同;使用ADDR_DATABUFF
			if(DI!=0)
			{
				return 1;
			}
		}
	}
	return 0;
}
u32 ReadMeter_Fn_Class2TimerTask(u32 Fn,u32 Pn)//FnPn在2类数据定时任务,返回:0=没,1=有
{
	u32 i;
	u32 Task;
	u32 MaxDINum;
	u32 DI;
	
	for(Task=0;Task<AFN04F66MaxPn;Task++)
	{
		i=MRR(ADDR_AFN04F68+Task,1);//定时发送2类数据任务启动／停止设置(任务号)
		if(i!=0x55)
		{//置"55H"：启动；置"AAH"停止；其它数值无效
			continue;
		}
		MaxDINum=MRR(ADDR_AFN04F66+((9+(4*MaxTimerTaskDI))*Task)+8,1);
		if(MaxDINum>MaxTimerTaskDI)
		{
			MaxDINum=MaxTimerTaskDI;
		}
		for(i=0;i<MaxDINum;i++)
		{
			DI=MRR(ADDR_AFN04F66+((9+(4*MaxTimerTaskDI))*Task)+9+(4*i),4);//取DI
			DI=CompFnPn(DI,Fn,Pn);//分解DI为Fn,Pn且比较;返回0=不同,1=有相同;使用ADDR_DATABUFF
			if(DI!=0)
			{
				return 1;
			}
		}
	}
	return 0;
}
#endif

u32 ReadMeter_Fn_Com(u32 Fn,u32 Pn,u32 ClassNo)
{
	u32 i;
	u32 y;
	
	y=0;
	i=GetClass2SourceDataAddr(Fn,Pn);//取类2原始数据存贮地址,返回0表示没找到,有效数据长度放ADDR_Terminal_ClassDataLen
	if(i!=0)
	{
		MR(ADDR_DATABUFF,i+2,3);//取原抄表时间年月日
		i=DataComp(ADDR_DATABUFF,ADDR_TYMDHMS+3,3);//数据比较,返回0=相等;当Byte>8时返回1=不相等;当Byte<=8时1=Data1>Data2,2=Data1<Data2
		if(i!=0)
		{
			y|=Class2Data_Fn(ClassNo,Fn);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
		#if RMM_TimerTask==1//0=不抄,1=自动抄读定时任务配置的相关数据
			y|=ReadMeter_Fn_Class2TimerTask(Fn,Pn);//FnPn在2类数据定时任务,返回:0=没,1=有;使用 ADDR_DATABUFF
		#endif
		}
	}
	return y;
}

u32 DateCongeal_Fn_YesNo(u32 ClassNo,u32 Pn,u8 * p8RMLib,u32 RMCount)//日冻结
{
	u32 i;
	u32 y;
	u32 Fn;
	
	switch(p8RMLib[0])
	{
		case 0xE3://日冻结正反有无功,4个象限无功电能示值（总、费率1～M）
			i=MRR(ADDR_TYMDHMS+3,3);
			i=YMD_Sub1D(i);//上1日冻结的时标年月日
			break;
		case 0xEE://补抄上1日日冻结正反有无功,4个象限无功电能示值（总、费率1～M）
			i=MRR(ADDR_TYMDHMS+3,3);
			i=YMD_Sub1D(i);
			i=YMD_Sub1D(i);//上2日冻结的时标年月日
			break;
		case 0xEF://补抄上2日日冻结正反有无功,4个象限无功电能示值（总、费率1～M）
			i=MRR(ADDR_TYMDHMS+3,3);
			i=YMD_Sub1D(i);
			i=YMD_Sub1D(i);
			i=YMD_Sub1D(i);//上3日冻结的时标年月日
			break;
		default:
			return 0;
	}
	if(i!=0)
	{//是日冻结0xe3或0xee或0xef
		i=GetDateCongealNo(i);//得到日冻结相同时标的冻结号,返回=0xffffffff表示没找到
		if(i!=0xffffffff)
		{//找到
			if((RMCount>0)&&(RMCount<9))
			{
				Fn=160+RMCount;//抄表命令计数1-8对应Fn=161-168
				y=ReadMeter_Fn_Com(Fn,Pn,ClassNo);
				if(y!=0)
				{//配置为要抄
					y=GetClass2DataOfficeAddr(Fn,Pn);//取类2数据存贮偏移地址,返回0表示没找到
					if(y!=0)
					{
						y=MRR(ADDR_DATECONGEAL_START+(LEN_DATECONGEAL*i)+y,1);//读x字节冻结数据
						if(y==0xff)
						{//还没抄
							return 1;
						}
					}
				}
			}
			else
			{//抄表命令计数=0或9,上1次日冻结时间YYMMDDhhmm
			#if RMM_CompCongealTime==1//读电能表冻结数据比较冻结时间:0=不比较,1=要比较
				for(Fn=161;Fn<168;Fn++)
				{
					y=ReadMeter_Fn_Com(Fn,Pn,ClassNo);
					if(y!=0)
					{//配置为要抄
						y=GetClass2DataOfficeAddr(Fn,Pn);//取类2数据存贮偏移地址,返回0表示没找到
						if(y!=0)
						{
							y=MRR(ADDR_DATECONGEAL_START+(LEN_DATECONGEAL*i)+y,1);//读x字节冻结数据
							if(y==0xff)
							{//还没抄
								return 1;
							}
						}
					}
				}
			#endif
			}
		}
	}
	return 0;
}

u32 Curve_Fn_YesNo(u32 ClassNo,u32 Pn,u8 * p8RMLib,u32 RMCount)//曲线
{
	u32 i;
	u32 Fn;
	u64 d64a;
	
	if((p8RMLib[4]&0x04)!=0)//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	{//2类数据,曲线
		//当前库中设为曲线有:扩展上1-24整点电表冻结的正反有功电能示值或负荷曲线
		#if RMM_RS485_IntegralCongeal==1//RS485通道抄表抄电表上1-24整点或曲线冻结;0=否,1=上1-24整点,2=曲线
			return 1;//已在抄表中判F101,F103是否配置
		#endif
		#if RMM_RS485_IntegralCongeal==2//RS485通道抄表抄电表上1-24整点或曲线冻结;0=否,1=上1-24整点,2=曲线
			Fn=p8RMLib[0];//取实时Fn
			if(Fn==0xE4)
			{//RS485用读全部6类负荷曲线
				if(RMCount==0)
				{//仅当命令计数=0时列表,减少运行时间
					KeyUserPnList();//集中抄表重点户曲线冻结Pn列表
				}
				i=KeyUserPnSet(Pn);//重点户有效测量点号检查;返回0=无效,1=有效;使用重点户曲线冻结Pn列表ADDR_KeyUserPnList
				if(i!=0)
				{//是重点户
					//补当前时间到上日0点的x点曲线冻结号
					i=Comm_Ram->TYMDHMS[1];//当前RTC分
					i=bcd_hex(i);
					i/=15;
					Fn=Comm_Ram->TYMDHMS[2];//当前RTC时
					Fn=bcd_hex(Fn);
					Fn*=4;//每小时4点
					i+=Fn;
					i+=96+1;//昨天96点,0点算1点
					Fn=p8RMLib[0];//取实时Fn
					if(RMCount<i)
					{
						d64a=MRR(ADDR_TYMDHMS+1,5);//取当前时间年月日时分
						d64a=YMDHM_Int15(d64a);//年月日时分化为整15分,如00时18分化为00时15分
						i=RMCount*15;//每15分间隔
						d64a=YMDHM_SubM(d64a,i);//年月日时分减m分,返回减m分后的年月日时分
						//RS485抄全部6类曲线,只检查F101即可
						i=CheckCurveCongeal(d64a,101,Pn);//检查曲线冻结;返回:0=数据没冻结,1=数据已冻结,2=没找到有效冻结
						if(i==0)
						{
							return 1;
						}
					}
				}
				return 0;
			}
			if((Fn>=0xE5)&&(Fn<=0xE9))
			{//载波用1-5类负荷曲线
			#if RMM_Carrier_CurveTime==15//载波通道读电表曲线的整冻结间隔时间分;15分或60分
				//补当前时间到上日0点的x点曲线冻结号
				i=Comm_Ram->TYMDHMS[1];//当前RTC分
				i=bcd_hex(i);
				i/=15;
				Fn=Comm_Ram->TYMDHMS[2];//当前RTC时
				Fn=bcd_hex(Fn);
				Fn*=4;//每小时4点
				i+=Fn;
				i+=96+1;//昨天96点,0点算1点
				Fn=p8RMLib[0];//取实时Fn
				if(RMCount>=i)
				{
					return 0;
				}
			#endif
			#if RMM_Carrier_CurveTime==60//载波通道读电表曲线的整冻结间隔时间分;15分或60分
				//补当前时间到上日0点的x点整点曲线冻结号
				i=Comm_Ram->TYMDHMS[2];//当前RTC时
				i=bcd_hex(i);
				i+=24+1;//昨天24点,0点算1点
				if(RMCount>=i)
				{
					return 0;
				}
			#endif
				if(RMCount==0)
				{//仅当命令计数=0时列表,减少运行时间
					KeyUserPnList();//集中抄表重点户曲线冻结Pn列表
				}
				i=KeyUserPnSet(Pn);//重点户有效测量点号检查;返回0=无效,1=有效;使用重点户曲线冻结Pn列表ADDR_KeyUserPnList
				if(i!=0)
				{//是重点户
					switch(Fn)
					{
						case 0xe5://1类负荷曲线(电压、电流、频率)
							Fn=89;//测量点A相电压曲线
							break;
						case 0xe6://2类负荷曲线(有无功功率)
							Fn=81;//测量点有功功率曲线
							break;
						case 0xe7://3类负荷曲线(功率因数)
							Fn=105;//测量点总功率因数
							break;
						case 0xe8://4类负荷曲线(正反有功,組合无功1和2总电能)
							Fn=101;//测量点正向有功总电能示值
							break;
						case 0xe9://5类负荷曲线(1-4象限无功总电能)
							Fn=145;//测量点1象限无功总电能示值曲线
							break;
					}
					i=Class2Data_Fn(ClassNo,Fn);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
					if(i!=0)
					{//有配置
						d64a=MRR(ADDR_TYMDHMS+1,5);//取当前时间年月日时分
					#if RMM_Carrier_CurveTime==15//载波通道读电表曲线的整冻结间隔时间分;15分或60分
						d64a=YMDHM_Int15(d64a);//年月日时分化为整15分,如00时18分化为00时15分
						i=RMCount*15;//每15分间隔
					#else
						d64a&=0xffffffff00;
						i=RMCount*60;//每60分间隔
					#endif
						d64a=YMDHM_SubM(d64a,i);//年月日时分减m分,返回减m分后的年月日时分
						i=CheckCurveCongeal(d64a,Fn,Pn);//检查曲线冻结;返回:0=数据没冻结,1=数据已冻结,2=没找到有效冻结
						if(i==0)
						{
							return 1;
						}
					}
				}
				return 0;
			}
		#endif
	}
	return 0;
}




