gdgly/NUC97X_JS/STM32F4xx/Terminal/Terminal_ReadMeter_Fn_Project2xx_USER6xx.c
u32 ReadMeter_Fn_YesNo(u32 PORTn,u32 ClassNo,u32 Pn,u8 * p8RMLib,u32 RMCount,u32 Protocol)//按大小类号抄表的Fn是否要抄;返回0=不抄,1=要抄;入口:ClassNo的D7-D4大类号D3-D0小类号,Pn,p8RMLib抄表库指针,RMCount抄表计数,Protocol(1=1997,其他=2007)
{
	u32 i;
	u32 y;
	u32 y1;
	u32 Fn;
	u64 d64a;
	u64 d64b;
  UARTCtrl_TypeDef * UARTCtrl;
	u16 *p16;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	y=0;
	y1=0;
	
	if(PORTn!=RS485_4PORT)//RS485_4(载波)
	{//是485口
	#if RMM_RS485_PassageZero==1//RS485通道抄表过0点;0=不暂停,1=暂停
		i=Comm_Ram->TYMDHMS[1]+(Comm_Ram->TYMDHMS[2]<<8);
		if((i>=RMM_EndHM)||(i<RMM_StartHM))
		{//RS485口在每日0点附近暂停抄表
			if(p8RMLib[4]&((1<<6)+(1<<5)+(1<<3)))//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
			{//2类数据B6=补抄上2-3日冻结,B5=月冻结,B3=日冻结
				return 0;//不抄日月冻结数据
			}
		}
	#endif
	}
	switch(UARTCtrl->RMTaskC)
	{
		case 0://0=上电任务
		case 3://3=定时抄读停电数据任务
			if(p8RMLib[0]==246)
			{
				if(UARTCtrl->RMTaskC==0)
				{
					if(RMCount>1)
					{
						return 0;//启抄只抄最近1次上电记录
					}
				}
				i=MRR(ADDR_AFN04F97,1);//停电数据采集配置参数
				i&=1;
				if(i==0)
				{
					return 0;//不采集
				}
				if(Terminal_Ram->F246PnListUpDate==0)//要抄读的掉电记录数据Pn列表已更新标志,0=要更新,!=0已更新
				{
					Terminal_Ram->F246PnListUpDate=0xFF;//要抄读的掉电记录数据Pn列表已更新标志,0=要更新,!=0已更新
					F246PnList();//要抄读的F246掉电记录数据Pn列表
				}
				switch(PORTn)
				{
					case RS485_1PORT://RS485-1
						p16=(u16*)(&Terminal_Ram->RS4851RMF246_S_Timer);//25 RS485-1停电事件抄读时间限值秒定时器
						break;
					case RS485_2PORT://RS485-2
						p16=(u16*)(&Terminal_Ram->RS4852RMF246_S_Timer);
						break;
					case RS485_3PORT://RS485-3
						p16=(u16*)(&Terminal_Ram->RS4853RMF246_S_Timer);
						break;
					case RS485_4PORT://RS485-4(载波)
						p16=(u16*)(&Terminal_Ram->RS4854RMF246_S_Timer);
						break;
					default:
						return 0;
				}
				if(p16[0]!=0)
				{
					i=F246MapPn(Pn);//F246掉电记录数据映射Pn;返回0表示无效
					if(i!=0)
					{
						return 1;
					}
				}
			}
			return 0;
		case 1://1=每日任务
		#if DateRMTask==0//每日抄表任务;0=没有,1=有
			#error DateRMTask=0
		#endif
			y=DateCongeal_Fn_YesNo(ClassNo,Pn,p8RMLib,RMCount);//日冻结
			//y|=Curve_Fn_YesNo(ClassNo,Pn,p8RMLib,RMCount);//曲线
			return y;
		case 2://2=每周任务(替代每日的时任务:三相表用户包括居民用户和工商业用户当前电压、电流、断相累计时间数据的采集)
		#if WeekRMTask==0//每周抄表任务;0=没有,1=有
			#error WeekRMTask=0
		#endif
			y=Curve_Fn_YesNo(ClassNo,Pn,p8RMLib,RMCount);//曲线
			if(y!=0)
			{
				return 1;
			}
			//用于三相表用户（包括居民用户和工商业用户）当前电压、电流、断相累计时间数据的采集
			if(p8RMLib[0]==25)
			{//F25仅取电压电流(不包括零序电流)数据
				y=Class1Data_Fn(ClassNo,25);//1类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
				if(y!=0)
				{
					if(Protocol==1)//1=1997,其他=2007
					{//1997
						if((RMCount>=12)&&(RMCount<=17))
						{
							return 1;
						}
					}
					else
					{//2007
						if((RMCount==3)||(RMCount==4))
						{
							return 1;
						}
					}
				}
				return 0;
			}
		#if RMM_AFN0CF26==0//AFN0CF26断相数据抄表;0=抄电表断相记录数据,1=抄电表失压记录数据
			if(p8RMLib[0]==26)
			{//F26仅取断相累计时间
				y=Class1Data_Fn(ClassNo,26);//1类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
				if(y!=0)
				{
					if(Protocol==1)//1=1997,其他=2007
					{//1997
						switch(RMCount)
						{
							case 5://A断相累计时间
							case 6://B断相累计时间
							case 7://C断相累计时间
								return 1;
						}
					}
					else
					{//2007
						switch(RMCount)
						{
							case 1://A断相累计时间
							case 3://B断相累计时间
							case 5://C断相累计时间
							//当以上命令不成功时为兼容用以下命令读
							case (12+0)://A,B,C相断相次数,累计时间
								return 1;
						}
					}
				}
				return 0;
			}
		#endif
		#if RMM_AFN0CF26==1//AFN0CF26断相数据抄表;0=抄电表断相记录数据,1=抄电表失压记录数据
			if(p8RMLib[0]==26)
			{//F26仅取失压累计时间
				y=Class1Data_Fn(ClassNo,26);//1类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
				if(y!=0)
				{
					if(Protocol==1)//1=1997,其他=2007
					{//1997
						switch(RMCount)
						{
							case 5://A断相累计时间
							case 6://B断相累计时间
							case 7://C断相累计时间
								return 1;
						}
					}
					else
					{//2007
						switch(RMCount)
						{
							case 4://总失压累计时间
							case 5://A失压累计时间
							case 6://B失压累计时间
							case 7://C失压累计时间
							//当以上命令不成功时为兼容用以下命令读
							case (16+0)://A,B,C相失压次数,累计时间
								return 1;
						}
					}
				}
				return 0;
			}
		#endif
			return 0;
		case 4://抄读重点户曲线(仅对无曲线冻结的单相表)
		#if HourTask==1//重点户曲线抄读(仅对无曲线冻结的单相表)
			if(p8RMLib[0]==1)
			{//重点户曲线
				KeyUserPnList();//集中抄表重点户曲线冻结Pn列表
				i=KeyUserPnSet(Pn);//重点户有效测量点号检查;返回0=无效,1=有效;使用重点户曲线冻结Pn列表ADDR_KeyUserPnList
				if(i!=0)
				{//是重点户
					i=Check_AFN04F10_Pn(Pn);//检查终端电能表/交流采样装置配置参数指定的测量点号;返回0无,!=0为相同测量点号的配置序号(1开始)
					if(i!=0)
					{
						i--;
						i=MRR(ADDR_AFN04F10+(LEN_AFN04F10_Pn*i)+26,1);//取大小类号
						if((i==0x50)||(i==0x51)||(i==0x40)||(i==0x41))
						{
							//return 1;
							
							switch(RMCount)
							{
								case 0://电压曲线
									y=Class2Data_Fn(ClassNo,89);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
									y|=Class2Data_Fn(ClassNo,90);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
									y|=Class2Data_Fn(ClassNo,91);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
									return y;
								case 1://当前正向有功总电能示值
									y=Class2Data_Fn(ClassNo,101);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
									return y;
								case 2://当前反向有功总电能示值
									y=Class2Data_Fn(ClassNo,103);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
									return y;
							}
							
						}
					}
				}
				return 0;
			}
		#endif
			return 0;
	#if EventProject==1//事件记录采集方案:0=原能走台体标准,1=按新智能电能表及采集终端事件记录采集规则
		case (MaxRMTask-2)://周期抄读电能表事件
			y=RMEvene_YesNo(PORTn,Pn,p8RMLib,RMCount,Protocol);//按分类分级事件抄读的Fn是否要抄;返回0=不抄,1=要抄;Pn,p8RMLib抄表库指针,RMCount抄表计数,Protocol(1=1997,其他=2007)
			return y;
	#endif
		case (MaxRMTask-1)://循抄任务
			break;
		default:
			return 0;
	}
	if(p8RMLib[0]==1)
	{//抄读重点户曲线(仅对无曲线冻结的单相表)
		return 0;//专在任务4抄
	}
	#if EventProject==1//事件记录采集方案:0=原能走台体标准,1=按新智能电能表及采集终端事件记录采集规则
	if(p8RMLib[0]==3)
	{//周期抄读电能表事件
		return 0;//专在任务MaxRMTask-2中抄
	}
	#endif
	switch(PORTn)
	{
		case RS485_1PORT://RS485_1
		case RS485_2PORT://RS485_2
		case RS485_3PORT://RS485_3
	#if RMM_RS485==0//RS485通道抄表模式:0=循抄全部数据,1=按大小类号设置抄读数据
			if((p8RMLib[4]&0x20)!=0)//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
			{//2类数据B5=月冻结
				y1=1;//全抄标志
				break;
			}
			if((p8RMLib[4]&0x04)!=0)//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
			{//2类数据,曲线
				y=1;
				break;
			}
			return 1;//返回0=不抄,1=要抄
	#else
			if(ClassNo==0)
			{
				if((p8RMLib[4]&0x20)!=0)//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
				{//2类数据B5=月冻结
					y1=1;//全抄标志
					break;
				}
				if((p8RMLib[4]&0x04)!=0)//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
				{//2类数据,曲线
					y=1;
					break;
				}
				return 1;
			}
			break;
	#endif
		case RS485_4PORT://RS485_4(载波)
			if(ClassNo==0)
			{
				if((p8RMLib[4]&0x20)!=0)//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
				{//2类数据B5=月冻结
					y1=1;//全抄标志
					break;
				}
				if((p8RMLib[4]&0x04)!=0)//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
				{//2类数据,曲线
					y=1;
					break;
				}
				return 1;
			}
			break;
	}
	//1类数据
	if((p8RMLib[4]&0x01)!=0)//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	{//1类数据,实时
		Fn=p8RMLib[0];//取实时Fn
		if(Fn==246)
		{//F246当前掉电记录数据,在定时任务中专抄
			return 0;
		}
//		if((Fn!=25)&&(Fn!=26))
//		{//F25,F26已在用周任务替代的每是时任务中抄
			y|=Class1Data_Fn(ClassNo,Fn);//1类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持		
		#if RMM_TimerTask==1//0=不抄,1=自动抄读定时任务配置的相关数据
			y|=ReadMeter_Fn_Class1TimerTask(Fn,Pn);//FnPn在1类数据定时任务,返回:0=没,1=有;使用 ADDR_DATABUFF
		#endif
//		}
		//1类实时数据与2类曲线配置相关
	#if (RMM_RS485_IntegralCongeal|RMM_Carrier_IntegralCongeal)==0//抄表抄电表上1-24整点或曲线冻结;0=否,1=上1-24整点,2=曲线
		if(y==0)
		{
			if(UARTCtrl->RMCount==0)
			{//仅当命令计数=0时列表,减少运行时间
				KeyUserPnList();//集中抄表重点户曲线冻结Pn列表
			}
			i=KeyUserPnSet(Pn);//重点户有效测量点号检查;返回0=无效,1=有效;使用重点户曲线冻结Pn列表ADDR_KeyUserPnList
			if(i!=0)
			{//是重点户
				//F25 当前三相及总有/无功功率、功率因数，三相电压、电流、零序电流、视在功率
				if(Fn==25)
				{
					if(Protocol==1)
					{//DL/T645-1997
						i=MRR((u32)&p8RMLib[10+(3*RMCount)],2);//取DI
						switch(i)
						{
						//F81-84测量点总,A,B,C相有功功率曲线
							case 0xb630://总有功功率
								y|=Class2Data_Fn(ClassNo,81);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								break;
							case 0xb631://A有功功率
								y|=Class2Data_Fn(ClassNo,82);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								break;
							case 0xb632://B有功功率
								y|=Class2Data_Fn(ClassNo,83);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								break;
							case 0xb633://C有功功率
								y|=Class2Data_Fn(ClassNo,84);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								break;
						//F85-88测量点总,A,B,C相无功功率曲线
							case 0xb640://总无功功率
								y|=Class2Data_Fn(ClassNo,85);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								break;
							case 0xb641://A无功功率
								y|=Class2Data_Fn(ClassNo,86);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								break;
							case 0xb642://B无功功率
								y|=Class2Data_Fn(ClassNo,87);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								break;
							case 0xb643://C无功功率
								y|=Class2Data_Fn(ClassNo,88);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								break;
							//F105-108测量点总,A,B,C相功率因数曲线
							case 0xb650://总功率因数
								y|=Class2Data_Fn(ClassNo,105);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								break;
							case 0xb651://A功率因数
								y|=Class2Data_Fn(ClassNo,106);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								break;
							case 0xb652://B功率因数
								y|=Class2Data_Fn(ClassNo,107);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								break;
							case 0xb653://C功率因数
								y|=Class2Data_Fn(ClassNo,108);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								break;
							//F89-91测量点A,B,C相电压曲线	
							case 0xb611://A相电压
								y|=Class2Data_Fn(ClassNo,89);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								break;
							case 0xb612://B相电压
								y|=Class2Data_Fn(ClassNo,90);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								break;
							case 0xb613://C相电压
								y|=Class2Data_Fn(ClassNo,91);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								break;
							//F92-94测量点A,B,C相电流曲线
							case 0xB621://A相电流
								y|=Class2Data_Fn(ClassNo,92);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								break;
							case 0xB622://B相电流
								y|=Class2Data_Fn(ClassNo,93);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								break;
							case 0xB623://C相电流
								y|=Class2Data_Fn(ClassNo,94);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								break;
						}
					}
					else
					{//DL/T645-2007
						i=MRR((u32)&p8RMLib[10+(5*RMCount)],4);//取DI
						switch(i)
						{
							case 0x0203ff00://总,A,B,C有功功率
								//F81-84测量点总,A,B,C相有功功率曲线
								y|=Class2Data_Fn(ClassNo,81);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								y|=Class2Data_Fn(ClassNo,82);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								y|=Class2Data_Fn(ClassNo,83);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								y|=Class2Data_Fn(ClassNo,84);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								break;
							case 0x0204ff00://总,A,B,C无功功率
								//F85-88测量点总,A,B,C相无功功率曲线
								y|=Class2Data_Fn(ClassNo,85);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								y|=Class2Data_Fn(ClassNo,86);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								y|=Class2Data_Fn(ClassNo,87);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								y|=Class2Data_Fn(ClassNo,88);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								break;
							case 0x0206ff00://总,A,B,C功率因数
								//F105-108测量点总,A,B,C相功率因数曲线
								y|=Class2Data_Fn(ClassNo,105);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								y|=Class2Data_Fn(ClassNo,106);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								y|=Class2Data_Fn(ClassNo,107);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								y|=Class2Data_Fn(ClassNo,108);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								break;
							case 0x0201ff00://A,B,C相电压
								//F89-91测量点A,B,C相电压曲线
								y|=Class2Data_Fn(ClassNo,89);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								y|=Class2Data_Fn(ClassNo,90);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								y|=Class2Data_Fn(ClassNo,91);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								break;
							case 0x0202ff00://A,B,C相电流
								//F92-94测量点A,B,C相电流曲线
								y|=Class2Data_Fn(ClassNo,92);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								y|=Class2Data_Fn(ClassNo,93);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								y|=Class2Data_Fn(ClassNo,94);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								break;
							case 0x02800001://零序电流
								//F95测量点零序电流曲线
								y|=Class2Data_Fn(ClassNo,95);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
								break;
							case 0x0205ff00://总,A,B,C视在功率
								break;
						}
					}
				}
				//F129 当前正向有功电能示值(已抄小时冻结)
				//F130 当前正向无功（组合无功1）电能示值
				if(Fn==130)
				{
					//F102测量点正向无功总电能示值曲线
					y|=Class2Data_Fn(ClassNo,102);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
				}
				//F131 当前反向有功电能示值(已抄小时冻结)
				//F132 当前反向无功（组合无功2）电能示值
				if(Fn==132)
				{
					//F104测量点反向无功总电能示值曲线
					y|=Class2Data_Fn(ClassNo,104);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
				}
				//F133 当前一象限无功电能示值
				if(Fn==133)
				{
					//F145测量点1象限无功总电能示值曲线
					y|=Class2Data_Fn(ClassNo,145);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
				}
				//F134 当前二象限无功电能示值
				if(Fn==134)
				{
					//F147测量点2象限无功总电能示值曲线
					y|=Class2Data_Fn(ClassNo,147);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
				}
				//F135 当前三象限无功电能示值
				if(Fn==135)
				{
					//F148测量点3象限无功总电能示值曲线
					y|=Class2Data_Fn(ClassNo,148);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
				}
				//F136 当前四象限无功电能示值
				if(Fn==136)
				{
					//F146测量点4象限无功总电能示值曲线
					y|=Class2Data_Fn(ClassNo,146);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
				}
			}
		}
	#endif
	}
	//2类数据
	if((p8RMLib[4]&0x10)!=0)//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	{//2类数据,抄表日冻结
		Fn=p8RMLib[8];//抄表日冻结Fn
		y|=Class2Data_Fn(ClassNo,Fn);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持		
	#if RMM_TimerTask==1//0=不抄,1=自动抄读定时任务配置的相关数据
		y|=ReadMeter_Fn_Class2TimerTask(Fn,Pn);//FnPn在2类数据定时任务,返回:0=没,1=有;使用 ADDR_DATABUFF
	#endif
	}
	y|=Curve_Fn_YesNo(ClassNo,Pn,p8RMLib,RMCount);//曲线
	
