gdgly/NUC97X_JS/STM32F4xx/Terminal/Terminal_ReadMeter_Fn_Project2xx_USER6xx.c
	//0xe3或0xee或0xef
	y|=DateCongeal_Fn_YesNo(ClassNo,Pn,p8RMLib,RMCount);//日冻结
	//其他日冻结
	if((p8RMLib[4]&0x08)!=0)//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	{//2类数据B3=日冻结
		Fn=p8RMLib[7];//取日冻结Fn
		y|=ReadMeter_Fn_Com(Fn,Pn,ClassNo);
	}
	
	if((p8RMLib[4]&0x20)!=0)//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	{//2类数据B5=月冻结
		if(p8RMLib[0]==165)//F165 电能表开关操作次数及时间
		{//月冻结标志同时又是ERC37开表盖ERC38开端钮盒事件数据
			if(y1==1)//全抄标志
			{
				d64a=MRR(ADDR_AFN04F9,8);//事件记录有效标志位 BS64 8
				d64b=1;
				d64b<<=(37-1);
				d64b&=d64a;
				if(d64b!=0)
				{
					return 1;
				}
				d64b=1;
				d64b<<=(38-1);
				d64b&=d64a;
				if(d64b!=0)
				{
					return 1;
				}
			}
		}
		if(p8RMLib[0]==166)//F166 电能表参数修改次数及时间
		{//月冻结标志同时又是ERC41直接读电能表对时事件记录
			if(y1==1)//全抄标志
			{
				d64a=MRR(ADDR_AFN04F9,8);//事件记录有效标志位 BS64 8
				d64b=1;
				d64b<<=(41-1);
				d64b&=d64a;
				if(d64b!=0)
				{
					return 1;
				}
			}
		}
		Fn=p8RMLib[9];//取月冻结Fn
		i=y1;
		i|=Class2Data_Fn(ClassNo,Fn);//2类数据Fn配置,入口ClassNo的D7-D4大类号D3-D0小类号,Fn;返回0=不支持,1=支持
	#if RMM_TimerTask==1//0=不抄,1=自动抄读定时任务配置的相关数据
		i|=ReadMeter_Fn_Class2TimerTask(Fn,Pn);//FnPn在2类数据定时任务,返回:0=没,1=有;使用 ADDR_DATABUFF
	#endif
		if(i!=0)
		{//有配置
			i=p8RMLib[0];
			if((i>=0xd1)&&(i<=0xdc))
			{//补抄上2月数据
				i=Comm_Ram->TYMDHMS[4]+(Comm_Ram->TYMDHMS[5]<<8);
				i=YM_Sub1M(i);//年月减1月,返回减1后的年月
				i=YM_Sub1M(i);//年月减1月,返回减1后的年月
				i=CheckMonthCongeal(i,Fn,Pn);//检查月冻结;返回:0=数据没冻结,1=数据已冻结,2=没找到有效冻结
				if(i==0)
				{//0=数据没冻结
					y|=1;
				}
			}
			else
			{
				i=GetClass1DataAddr(p8RMLib[0],Pn);//取类1数据存贮地址,返回0表示没找到,有效数据长度放ADDR_Terminal_ClassDataLen
				if(i!=0)
				{
					if((p8RMLib[0]==165)||(p8RMLib[0]==166)||(p8RMLib[0]==167))
					{//F165 电能表开关操作次数及时间,F166 电能表参数修改次数及时间,F167 电能表购、用电信息
						return 1;//月冻结用实时数据,总是要实抄
					}
					i=DataComp(i+3,ADDR_TYMDHMS+4,2);//数据比较,返回0=相等;当Byte>8时返回1=不相等;当Byte<=8时1=Data1>Data2,2=Data1<Data2
					if(i!=0)
					{//0=相等
						y|=1;
					}
				}
			}
		}
	}
	
	//事件
	Fn=p8RMLib[0];
	d64a=MRR(ADDR_AFN04F9,8);//事件记录有效标志位 BS64 8
	//ERC8电能表参数变更事件用数据
	if(Fn==0xE1)
	{
		d64b=1;
		d64b<<=(8-1);
		d64b&=d64a;
		if(d64b!=0)
		{
			y=1;
		}
	}
	//ERC13电表故障信息事件用数据
	if(Fn==0xE2)
	{
		d64b=1;
		d64b<<=(13-1);
		d64b&=d64a;
		if(d64b!=0)
		{
			y=1;
		}
	}
	//ERC40读电能表恒定磁场干扰总次数(当前只有三相表才有)
	if(Fn==0xF0)
	{
		i=ClassNo>>4;
		switch(i)//大类号
		{
			case 3://三相工商业（C类3x）
			case 5://居民用户（E类52）
			case 6://公用配变考核计量点（F类6x）
				if(i==5)
				{
					if((ClassNo&0xf)!=2)
					{
						break;
					}
				}
				d64b=1;
				d64b<<=(40-1);//ERC40磁场异常事件记录
				d64b&=d64a;
				if(d64b!=0)
				{
					y=1;
				}
				break;
		}
	}


#if RMM_Event==1//0=不抄,1=自动抄读事件记录配置的相关数据
	//ERC8电能表参数变更事件
	//ERC11相序异常
	//ERC12电能表时间超差
	//ERC13电表故障信息事件
	//ERC27电能表示度下降
	//ERC33电能表运行状态字变位事件
	//ERC37电能表开表盖事件
	//ERC38电能表开端盖事件
	//ERC40直接读电能表磁场异常事件记录
	//ERC41电能表被非终端对时事件记录
	switch(Fn)
	{
//		case 27://F27 电能表日历时钟、编程次数及其最近一次操作时间
//			goto RMERC1;
		case 28://F28 电表运行状态字及其变位标志
			switch(PORTn)
			{
				case RS485_1PORT://RS485-1
					i=1;//RS485PORT=1;
					break;
				case RS485_2PORT://RS485-2
					i=2;//RS485PORT=2;
					break;
				case RS485_3PORT://RS485-3
					i=3;//RS485PORT=3;
					break;
				default://RS485-4(载波)
					i=30;//RS485PORT=4
					break;
			}
			i=MRR(ADDR_AFN04F33+((14+(4*24))*i)+1,1);//终端抄表运行参数设置,端口31
			if(i&0x20)
			{//2)	D5置"1"要求终端抄读"电表状态字"，置"0"不要求
				y=1;
			}
			d64b=1;
			d64b<<=(11-1);//ERC11相序异常
			d64b&=d64a;
			if(d64b!=0)
			{
				y=1;
			}
			d64b=1;
			d64b<<=(33-1);//ERC33电能表运行状态字变位事件
			d64b&=d64a;
			if(d64b!=0)
			{
				y=1;
			}
			break;
		case 165://F165 电能表开关操作次数及时间
			d64b=3;
			d64b<<=(37-1);//ERC37电能表开表盖事件,ERC38电能表开端盖事件
			goto RMERC2;
		case 129://F129 当前正向有功电能示值（总、费率1～M）
			d64b=1;
			d64b<<=(27-1);//ERC27电能表示度下降
			goto RMERC2;
		case 162://F162 电能表日历时钟
			d64b=1;
			d64b<<=(12-1);//ERC12电能表时间超差
			goto RMERC2;
		case 166://F166 电能表参数修改次数及时间
			d64b=1;
			d64b<<=(41-1);//ERC41电能表被非终端对时事件记录
			goto RMERC2;
		case 0xe1://扩展1 ERC8电能表参数变更事件用数据
			d64b=1;
			d64b<<=(8-1);//ERC8电能表参数变更事件
			goto RMERC2;
		case 0xe2://扩展2 ERC13电表故障信息事件用数据
			d64b=1;
			d64b<<=(13-1);//ERC13电表故障信息事件
		RMERC2:
			d64b&=d64a;
			if(d64b!=0)
			{
				y=1;
			}
			break;
	}
#endif

	return y;
}






#endif
#endif

